app/controllers/api/v1/products_controller.rb

UPDATE "products" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["name", "prueba2"], ["description", "probando casi2 nuevas"], ["updated_at", "2024-09-18 07:43:34.140310"], ["id", 4]]
---
            def update
                if @product.update(product_params)

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "motor"], ["description", "probando casi5 nuevas"], ["price", 5000], ["created_at", "2024-09-19 01:25:18.436504"], ["updated_at", "2024-09-19 01:25:18.436504"], ["user_id", 1]]
---
            def create
                #puts current_user.id
                @product = Product.new(product_params.merge(user_id: current_user.id))
                #@product = current_user.products.build(product_params)
                if @product.save

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 5]]
---
            def destroy
                if @product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
            def set_product
                @product = Product.find(params[:id])